In [2]:
import pandas as pd

# Data Analysis with Pandas

Pandas: the Python Data Analysis Library

## DataFrame and Series
The core data structures in Pandas

### Dataframe
Main Components:

- Index (down)
- Columns (across)
- data (whats in the dataframe, can be found by its index and column)

Similar to a two dimensional array, but the rows and columns have labels, and each column can have a different data type

### Series

ITS ALMOST LIKE ONE DIMENSIONAL ARRAT, BUT WITH LABELS.

easisly to turn excel into a pandas DataFrame:

In [4]:
pd.read_excel("Excel Puppy Assignment.xlsx")

,Product,Price,Quantity,Total Spent,Money,Money Spent,Money Left
0,Puppy Adoption,69.50,NaN,0,200.0,0.0,200.0
1,Doggy Bed,41.88,NaN,0,NaN,NaN,NaN
2,Doggy Pillow,29.99,NaN,0,NaN,NaN,NaN
3,Collar,9.98,NaN,0,NaN,NaN,NaN
4,Short Leash,16.99,NaN,0,NaN,NaN,NaN
5,Retractable Leash,21.75,NaN,0,NaN,NaN,NaN
6,Chew Toys,7.99,NaN,0,NaN,NaN,NaN
7,4 Pack Fetch Toys,12.98,NaN,0,NaN,NaN,NaN
8,Dog House,69.99,NaN,0,NaN,NaN,NaN
9,1 Steel Bowl,12.99,NaN,0,NaN,NaN,NaN
10,Plastic Bowls,9.50,NaN,0,NaN,NaN,NaN
11,Bag O' Dog Treats,14.99,NaN,0,NaN,NaN,NaN
12,Good Dog Food,16.98,NaN,0,NaN,NaN,NaN
13,Best Dog Food,21.95,NaN,0,NaN,NaN,NaN
14,GPS Pet Finder,55.00,NaN,0,NaN,NaN,NaN
15,Training Classes,30.00,NaN,0,NaN,NaN,NaN

How to make a Pandas table without an excel file:

In [15]:
source_data = [["Mark", 55, "Italy", 4.5, "Europe"],
                ["John", 33, "USA", 6.7, "America"],
                ["Tim", 41, "USA", 3.9, "America"],
                ["Jenny", 12, "Germany", 9.0, "Europe"]]
df = pd.DataFrame(data=source_data,
                columns=["name", "age", "country",
                "score", "continent"],
                index=[1001, 1000, 1002, 1003])
df.index.name = "user_id"
df

          name  age  country  score continent
user_id
1001      Mark   55    Italy    4.5    Europe
1000      John   33      USA    6.7   America
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe

to remove the index, use .reset_index()

In this case the index is user_id, but if it isn't set Pandas will make one.

If you write .reset_index().set_index("name"), you can reset it to something else.

rename with the rename function of .rename(columns={old_column: new_column, etc.})

to delete, use .drop(columns=[], index=[])
these drop the respective indexes and columns

df.T transposes

In [10]:
df.T

user_id      1001     1000     1002     1003
name         Mark     John      Tim    Jenny
age            55       33       41       12
country     Italy      USA      USA  Germany
score         4.5      6.7      3.9      9.0
continent  Europe  America  America   Europe

## Data Manipulation

### Selecting Data

#### Selecting by label

- most common way to access data is by referring to its labels
- loc stands for location, and is used to specify which rows and columns you want

df.loc[row_selection, column_selection]

examples:

In [25]:
source_data3 = [["Single Value", "Scalar", "df.loc[1000,\"country\"]"],
            ["One column (1d)", "Series", "df.loc[:, \"country\"] or df.loc[\"country\"]"],
            ["One column (2d)", "DataFrame", "df.loc[:, [\"country\"]]"],
            ["Multiple columns", "DataFrame", "df.loc[:, [\"country\", \"age\"]]"],
            ["Range of columns", "DataFrame", "df.loc[:, \"name\":\"country\"]"],
            ["One row (1d)", "Series", "df.loc[1000, :]"],
            ["One row, (2d)", "DataFrame", "df.loc[[1000], :]"],
            ["Multiple rows", "DataFrame", "df.loc[[1003, 1000], :]"],
            ["Range of rows", "DataFrame", "df.loc[1000:1002, :]"]]
df3 = pd.DataFrame(data=source_data3,
                columns = ["Selection", "Return Data Type", "Example"])
df3

,Selection,Return Data Type,Example
0,Single Value,Scalar,"df.loc[1000,""country""]"
1,One column (1d),Series,"df.loc[:, ""country""] or df.loc[""country""]"
2,One column (2d),DataFrame,"df.loc[:, [""country""]]"
3,Multiple columns,DataFrame,"df.loc[:, [""country"", ""age""]]"
4,Range of columns,DataFrame,"df.loc[:, ""name"":""country""]"
5,One row (1d),Series,"df.loc[1000, :]"
6,"One row, (2d)",DataFrame,"df.loc[[1000], :]"
7,Multiple rows,DataFrame,"df.loc[[1003, 1000], :]"
8,Range of rows,DataFrame,"df.loc[1000:1002, :]"

#### Selecting by Position
iloc, or integer location can be used to find
- Same as loc, but looks at column and row numbers, not names.

In [24]:
source_data4 = [["Single Value", "Scalar", "df.iloc[1, 2]"],
            ["One column (1d)", "Series", "df.iloc[:, 2]"],
            ["One column (2d)", "DataFrame", "df.iloc[:, [2]]"],
            ["Multiple columns", "DataFrame", "df.iloc[:, [2, 1]]"],
            ["Range of columns", "DataFrame", "df.iloc[:, :3]"],
            ["One row (1d)", "Series", "df.iloc[1, :]"],
            ["One row, (2d)", "DataFrame", "df.iloc[[1], :]"],
            ["Multiple rows", "DataFrame", "df.iloc[[3, 1], :]"],
            ["Range of rows", "DataFrame", "df.iloc[1:3, :]"]]
df4 = pd.DataFrame(data=source_data4,
                columns = ["Selection", "Return Data Type", "Example"])
df4

          Selection Return Data Type             Example
0      Single Value           Scalar       df.iloc[1, 2]
1   One column (1d)           Series       df.iloc[:, 2]
2   One column (2d)        DataFrame     df.iloc[:, [2]]
3  Multiple columns        DataFrame  df.iloc[:, [2, 1]]
4  Range of columns        DataFrame      df.iloc[:, :3]
5      One row (1d)           Series       df.iloc[1, :]
6     One row, (2d)        DataFrame     df.iloc[[1], :]
7     Multiple rows        DataFrame  df.iloc[[3, 1], :]
8     Range of rows        DataFrame     df.iloc[1:3, :]

#### Selecting by boolean indexing
Using a version of if statements to filter results.

Make sure each condition is in its own parenthesis and seperated by an &

To filter indexes, use df.index instead of df[column_name]

In [20]:
tf = (df["age"] > 40) & (df["country"] == "USA")
print(tf)

user_id
1001    False
1000    False
1002     True
1003    False
dtype: bool

sets a variable to the true or false values for each row and if it satisfies both requirements from all rows checked. 

We can look at everything about the filtered results like this:

In [21]:
df.loc[tf, :]

        name  age country  score continent
user_id
1002     Tim   41     USA    3.9   America

There are some limitations to this, like you can't use the standard python boolean operators to filter results.
Here are the conversions:

and --> &

or --> |

not --> ~

you can use isin to check if something is withing a set of values like this:

In [22]:
df.loc[df["country"].isin(["Italy", "Germany"])]

          name  age  country  score continent
user_id
1001      Mark   55    Italy    4.5    Europe
1003     Jenny   12  Germany    9.0    Europe

### Setting Data

#### Setting data by label or position
Methods like .reset_index() will make a copy of the DataFrame to make edits on, but using loc or iloc will edit the original. If you don't want this, you can use df.copy() to make a copy and set it to a variable.

In [26]:
df2 = df.copy()

When you want to make an adjustment, select it and then set it equal to a new value.

In [27]:
df2.loc[1000, "name"] = "JOHN"
df2

          name  age  country  score continent
user_id
1001      Mark   55    Italy    4.5    Europe
1000      JOHN   33      USA    6.7   America
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe

You can use lists too!

In [28]:
df2.loc[[1000, 1001], "score"] = [3, 4]
df2

          name  age  country  score continent
user_id
1001      Mark   55    Italy    4.0    Europe
1000      JOHN   33      USA    3.0   America
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe

#### Setting data by boolean indexing

works similarly, just get your tf and plug that into df2.loc[tf, changing_column/row] = new_value

#### Setting it for specific data, not specific column or index

Just going to make a sample table and a copy:

In [36]:
rainfall = pd.DataFrame(data={"City 1": [300.1, 100.2],
                                    "City 2": [400.3, 300.4],
                                    "City 3": [1000.5, 1100.6]})
rainfall2 = rainfall.copy()
rainfall

   City 1  City 2  City 3
0   300.1   400.3  1000.5
1   100.2   300.4  1100.6

Now to filter and set:

In [33]:
rainfall2[rainfall < 400] = 0
rainfall2

   City 1  City 2  City 3
0     0.0   400.3  1000.5
1     0.0     0.0  1100.6

#### The easy way

simple. Use db.replace

In [37]:
df2.replace("USA", "U.S.")

          name  age  country  score continent
user_id
1001      Mark   55    Italy    4.0    Europe
1000      JOHN   33     U.S.    3.0   America
1002       Tim   41     U.S.    3.9   America
1003     Jenny   12  Germany    9.0    Europe

To be more clear on the column if you need:

In [38]:
df2.replace({"country": {"USA": "U.S."}})

          name  age  country  score continent
user_id
1001      Mark   55    Italy    4.0    Europe
1000      JOHN   33     U.S.    3.0   America
1002       Tim   41     U.S.    3.9   America
1003     Jenny   12  Germany    9.0    Europe

#### Setting data by adding a new column
To set data in a new column, fake it till you make it

In [40]:
df2.loc[:, "discount"] = 0
df2.loc[:, "price"] = [49.9, 49.9, 99.9, 99.9]
df2

          name  age  country  score continent  discount  price
user_id
1001      Mark   55    Italy    4.0    Europe         0   49.9
1000      JOHN   33      USA    3.0   America         0   49.9
1002       Tim   41      USA    3.9   America         0   99.9
1003     Jenny   12  Germany    9.0    Europe         0   99.9

### Missing Data
- Displayed as NaN, or pd.nan
- If its a time, its NaT instead
NaN stand for Not-a-Number
NaT stand for Not-a-Time

To drop all rows that have any Na values, use .dropna()

To drop only rows where all values are NaN or none, use how="all" in the parameters

.dropna(how="all")

to find Na values, use .isna()

to fill na values use .fillna({column_name: df2[column_name].mean()})

#### Duplicate Data

use .drop_duplicates([column2drop, column2drop2])
- This keeps the first occurrence of the value

to find all unique occurrences, use df.index instead of [column2drop , column2drop2]

to find duplicated rows use df[column_name].duplicated()
or .index.duplicated()

by default keep="first", if you set this to keep=False in the parenthesis in .duplicated()

### Arithmetic Operations
Also Use vectorization like NumPy

you can use .add() to add two tables by putting the second table in parenthesis, and overlaping data gets added together, and if you want to replace no overlap from NaN to 0, use , fill_value=0 after the second table in the parenthesis.

Arithmetic operators (. to prevent it making bullet points):

.* --> multiply

.+ --> add

.- --> subtract

./ --> divide

.** --> power

When you have a dataFrame and a Series in your calc. the Series is broadcast along the index

In [41]:
rainfall.loc[1, :]

City 1     100.2
City 2     300.4
City 3    1100.6
Name: 1, dtype: float64

In [42]:
rainfall + rainfall.loc[1, :]

   City 1  City 2  City 3
0   400.3   700.7  2101.1
1   200.4   600.8  2201.2

add axis = 0 to specify to add it column-wise

In [46]:
rainfall.add(rainfall.loc[:, "City 2"], axis = 0)

   City 1  City 2  City 3
0   700.4   800.6  1400.8
1   400.6   600.8  1401.0

### Working with Text Columns
you can use special methods to change the data, like str to make everything strings, strip to remove excess white space, and capitalize to capitalize the data.

In [47]:
users = pd.DataFrame(data=[" mArk ", "JOHN  ", "Tim", " jenny"],
                    columns=["name"])
users

     name
0   mArk
1  JOHN
2     Tim
3   jenny

In [48]:
users_cleaned = users.loc[:, "name"].str.strip().str.capitalize()
users_cleaned

0     Mark
1     John
2      Tim
3    Jenny
Name: name, dtype: object

To find data with a specific atribute you can use certain commands, like:

In [49]:
users_cleaned.str.startswith("J")

0    False
1     True
2    False
3     True
Name: name, dtype: bool

### Applying Functions
You can apply your own functions to DataFrames using the applymap function, make sure you don't call it, ie. format_string not format_string()

In [50]:
rainfall

   City 1  City 2  City 3
0   300.1   400.3  1000.5
1   100.2   300.4  1100.6

In [51]:
def format_string(x):
    return f"{x:,.2f}"

In [52]:
rainfall.applymap(format_string)

/var/folders/lf/t_bnv8q527v32yq91lk76vnm0000gp/T/ipykernel_75228/3686163637.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  rainfall.applymap(format_string)

   City 1  City 2    City 3
0  300.10  400.30  1,000.50
1  100.20  300.40  1,100.60

Also works with lambda, which lets you do the same thing without having to define the function

In [53]:
rainfall.applymap(lambda x: f"{x:,.2f}")

/var/folders/lf/t_bnv8q527v32yq91lk76vnm0000gp/T/ipykernel_75228/4147439152.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  rainfall.applymap(lambda x: f"{x:,.2f}")

   City 1  City 2    City 3
0  300.10  400.30  1,000.50
1  100.20  300.40  1,100.60

### View vs Copy
unlike numPy, it isn't easy to tell if loc and iloc return views or copies

To make it easy:
- set values to the OG DataFrame, not one that has been sliced off of another DataFrame
- if you need a copy, use the .copy() covered earlier
- all DataFrame methods like .dropna() and .sort_values() ALWAYS return copies

## Descriptive Statistics and Data Aggregation
Best way to make sense of big datasets
##### Ways to aggregate data:
groupby and pivot_table functions

### Descriptive Statistics
- Summarize datasets by using quantitative measurements
- ie. number of data points, and averages (sums, means, and counts)
- By default they return along axis=0, so you get statistics of the column, not the row.

In [54]:
rainfall

   City 1  City 2  City 3
0   300.1   400.3  1000.5
1   100.2   300.4  1100.6

In [57]:
rainfall.mean()

City 1     200.15
City 2     350.35
City 3    1050.55
dtype: float64

Add the axis= key to get along a specific axis

In [56]:
rainfall.mean(axis=1)

0    566.966667
1    500.400000
dtype: float64

### Grouping
you can use .groupby([column_name]), and then use mean or count.

In [67]:
df.groupby(["continent"])

In [68]:
df.groupby(["continent", "country"])